---
kind: enumMember
id: F:Autodesk.Revit.DB.RevisionNumberType.None
enum: Autodesk.Revit.DB.RevisionNumberType
source: html/9bbde707-5b86-1f51-d6a4-7c12cb8ac6e5.htm
---
# Autodesk.Revit.DB.RevisionNumberType.None

No Revision Number will be assigned.